app/Controllers/Admin.php

SELECT *
FROM `egg_types`
---
    public function stockIntake()
    {
        $eggTypeModel = new EggTypeModel();
        $data['eggTypes'] = $eggTypeModel->findAll();

INSERT INTO `stock_batches` (`batch_id`, `egg_type_id`, `quantity_added`, `quantity_remaining`, `laid_date`, `expiry_date`, `supplier_name`, `created_at`, `updated_at`) VALUES ('2001', '1', '450', '450', '2026-05-07', '2026-06-06', 'happy farm corp', '2026-05-07 05:49:19', '2026-05-07 05:49:19')
---
    public function addStock()
    {
        $rules = [
            'batch_id' => 'required|is_unique[stock_batches.batch_id]',
            'egg_type_id' => 'required',
            'quantity' => 'required|numeric',
            'laid_date' => 'required|valid_date',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $stockBatchModel = new StockBatchModel();

        $laidDate = $this->request->getPost('laid_date');
        // Simple expiry logic: 30 days from laid date
        $expiryDate = date('Y-m-d', strtotime($laidDate . ' + 30 days'));

        $stockBatchModel->save([
            'batch_id' => $this->request->getPost('batch_id'),
            'egg_type_id' => $this->request->getPost('egg_type_id'),
            'quantity_added' => $this->request->getPost('quantity'),
            'quantity_remaining' => $this->request->getPost('quantity'),
            'laid_date' => $laidDate,
            'expiry_date' => $expiryDate,
            'supplier_name' => $this->request->getPost('supplier_name'),
        ]);

SELECT `stock_batches`.*, `egg_types`.`name` as `egg_name`
FROM `stock_batches`
JOIN `egg_types` ON `egg_types`.`id` = `stock_batches`.`egg_type_id`
ORDER BY `expiry_date` ASC
SELECT *
FROM `egg_types`
---
    public function inventory()
    {
        $stockBatchModel = new StockBatchModel();
        $eggTypeModel = new EggTypeModel();

        $data['batches'] = $stockBatchModel->select('stock_batches.*, egg_types.name as egg_name')
                                           ->join('egg_types', 'egg_types.id = stock_batches.egg_type_id')
                                           ->orderBy('expiry_date', 'ASC')
                                           ->findAll();

        $data['nearExpiry'] = $stockBatchModel->getNearExpiry();
        $data['eggTypes'] = $eggTypeModel->findAll();

SELECT `orders`.*, `users`.`username`
FROM `orders`
JOIN `users` ON `users`.`id` = `orders`.`user_id`
WHERE `orders`.`status` = 'Cancelled'
AND `orders`.`payment_status` = 'Unpaid'
ORDER BY `orders`.`created_at` DESC
---
    public function orders()
    {
        $orderModel = new \App\Models\OrderModel();

        $status = $this->request->getGet('status');
        $payment_status = $this->request->getGet('payment_status');
        $date = $this->request->getGet('date');

        $query = $orderModel->select('orders.*, users.username')
                            ->join('users', 'users.id = orders.user_id');

        if ($status) {
            $query->where('orders.status', $status);
        }
        if ($payment_status) {
            $query->where('orders.payment_status', $payment_status);
        }
        if ($date) {
            $query->where('DATE(orders.created_at)', $date);
        }

        $data['orders'] = $query->orderBy('orders.created_at', 'DESC')->findAll();

UPDATE `orders` SET `status` = 'Packing', `quality_checked` = 1, `updated_at` = '2026-05-15 04:43:34'
WHERE `orders`.`id` IN ('7')
---
            $updateData['payment_status'] = 'Paid';
        }

        $orderModel->update($orderId, $updateData);