app/Controllers/UserController.php

    public function index()
    {
        $userModel = new UserModel();
        $data['users'] = $userModel->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL