app/Models/StockBatchModel.php

    public function getNearExpiry()
    {
        return $this->where('expiry_date <=', date('Y-m-d', strtotime('+3 days')))
                    ->where('quantity_remaining >', 0)
                    ->findAll();
---
SELECT *
FROM `stock_batches`
WHERE `expiry_date` <= '2026-05-10'
AND `quantity_remaining` > 0